In [1]:
import pandas as pd

In [3]:
try:
    global df
    df = pd.read_csv('listings.csv')
except FileNotFoundError:
    print("Error: 'listings.csv' file not found.")
    exit(1)

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,13913,Holiday London DB Room Let-on going,54730,Alina,NaN,Islington,51.56861,-0.11270,Private room,70.0,1,55,2025-08-21,0.30,2,331,10,NaN
1,15400,Bright Chelsea Apartment. Chelsea!,60302,Philippa,NaN,Kensington and Chelsea,51.48780,-0.16813,Entire home/apt,149.0,4,97,2025-04-05,0.51,1,199,1,NaN

In [6]:
df.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,13913,Holiday London DB Room Let-on going,54730,Alina,NaN,Islington,51.56861,-0.11270,Private room,70.0,1,55,2025-08-21,0.30,2,331,10,NaN
1,15400,Bright Chelsea Apartment. Chelsea!,60302,Philippa,NaN,Kensington and Chelsea,51.48780,-0.16813,Entire home/apt,149.0,4,97,2025-04-05,0.51,1,199,1,NaN
2,17402,Very Central Modern 3-Bed/2 Bath By Oxford St W1,67564,Liz,NaN,Westminster,51.52195,-0.14094,Entire home/apt,411.0,3,56,2024-02-19,0.32,2,80,0,NaN
3,24328,Battersea live/work artist house,41759,Joe,NaN,Wandsworth,51.47072,-0.16266,Entire home/apt,NaN,7,95,2025-07-05,0.53,1,294,1,NaN
4,36274,Bright 1 bedroom apt off brick lane in Shoreditch,133271,Hendryks,NaN,Tower Hamlets,51.52322,-0.06979,Entire home/apt,210.0,5,15,2025-09-06,0.09,2,323,6,NaN

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96871 entries, 0 to 96870
Data columns (total 18 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              96871 non-null  int64
 1   name                            96871 non-null  object
 2   host_id                         96871 non-null  int64
 3   host_name                       96828 non-null  object
 4   neighbourhood_group             0 non-null      float64
 5   neighbourhood                   96871 non-null  object
 6   latitude                        96871 non-null  float64
 7   longitude                       96871 non-null  float64
 8   room_type                       96871 non-null  object
 9   price                           61963 non-null  float64
 10  minimum_nights                  96871 non-null  int64
 11  number_of_reviews               96871 non-null  int64
 12  last_review                     72749 non-null  object
 13  reviews_per_month               72749 non-null  float64
 14  calculated_host_listings_count  96871 non-null  int64
 15  availability_365                96871 non-null  int64
 16  number_of_reviews_ltm           96871 non-null  int64
 17  license                         0 non-null      float64
dtypes: float64(6), int64(7), object(5)
memory usage: 13.3+ MB

In [9]:
df.describe()

,id,host_id,neighbourhood_group,latitude,longitude,price,minimum_nights,number_of_reviews,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
count,9.687100e+04,9.687100e+04,0.0,96871.000000,96871.000000,6.196300e+04,96871.000000,96871.000000,72749.000000,96871.000000,96871.000000,96871.000000,0.0
mean,6.894448e+17,2.144494e+08,NaN,51.509740,-0.127638,2.299170e+02,5.440297,21.657627,0.990334,16.685499,144.927429,5.709614,NaN
std,5.941222e+17,2.196053e+08,NaN,0.049067,0.101112,4.437589e+03,23.686681,50.368644,1.304282,53.130290,141.808279,11.996770,NaN
min,1.391300e+04,2.594000e+03,NaN,51.295937,-0.496760,7.000000e+00,1.000000,0.000000,0.010000,1.000000,0.000000,0.000000,NaN
25%,3.026058e+07,2.726814e+07,NaN,51.484150,-0.189468,7.700000e+01,1.000000,1.000000,0.150000,1.000000,0.000000,0.000000,NaN
50%,8.505248e+17,1.164321e+08,NaN,51.513720,-0.127505,1.350000e+02,2.000000,5.000000,0.520000,2.000000,96.000000,0.000000,NaN
75%,1.254262e+18,4.198974e+08,NaN,51.539108,-0.068316,2.210000e+02,4.000000,20.000000,1.290000,8.000000,288.000000,6.000000,NaN
max,1.508964e+18,7.186905e+08,NaN,51.682630,0.278960,1.085147e+06,1125.000000,1902.000000,36.960000,500.000000,365.000000,390.000000,NaN

In [10]:
df.columns

Index(['id', 'name', 'host_id', 'host_name', 'neighbourhood_group',
       'neighbourhood', 'latitude', 'longitude', 'room_type', 'price',
       'minimum_nights', 'number_of_reviews', 'last_review',
       'reviews_per_month', 'calculated_host_listings_count',
       'availability_365', 'number_of_reviews_ltm', 'license'],
      dtype='object')

In [11]:
df['price']

0         70.0
1        149.0
2        411.0
3          NaN
4        210.0
         ...
96866    298.0
96867     66.0
96868    350.0
96869     40.0
96870    139.0
Name: price, Length: 96871, dtype: float64

In [16]:
# --- Data cleaning ---

In [17]:
clean_df = df.copy()

In [19]:
pd.to_datetime(clean_df['last_review'], errors='coerce')

0       2025-08-21
1       2025-04-05
2       2024-02-19
3       2025-07-05
4       2025-09-06
           ...
96866          NaT
96867   2025-09-15
96868          NaT
96869          NaT
96870          NaT
Name: last_review, Length: 96871, dtype: datetime64[ns]

In [20]:
clean_df['last_review'] = pd.to_datetime(clean_df['last_review'], errors='coerce')

In [26]:
clean_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96871 entries, 0 to 96870
Data columns (total 19 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              96871 non-null  int64
 1   name                            96871 non-null  object
 2   host_id                         96871 non-null  int64
 3   host_name                       96828 non-null  object
 4   neighbourhood_group             0 non-null      float64
 5   neighbourhood                   96871 non-null  object
 6   latitude                        96871 non-null  float64
 7   longitude                       96871 non-null  float64
 8   room_type                       96871 non-null  object
 9   price                           61963 non-null  float64
 10  minimum_nights                  96871 non-null  int64
 11  number_of_reviews               96871 non-null  int64
 12  last_review                     72749 non-null  datetime64[ns]
 13  reviews_per_month               72749 non-null  float64
 14  calculated_host_listings_count  96871 non-null  int64
 15  availability_365                96871 non-null  int64
 16  number_of_reviews_ltm           96871 non-null  int64
 17  license                         0 non-null      float64
 18  price_per_booking               61963 non-null  float64
dtypes: datetime64[ns](1), float64(7), int64(7), object(4)
memory usage: 14.0+ MB

In [23]:
# --- Data enrichment ---
# price_per_booking = price * minimum_nights

In [24]:
clean_df['price_per_booking'] = clean_df['price'] * clean_df['minimum_nights']

In [27]:
clean_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96871 entries, 0 to 96870
Data columns (total 19 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              96871 non-null  int64
 1   name                            96871 non-null  object
 2   host_id                         96871 non-null  int64
 3   host_name                       96828 non-null  object
 4   neighbourhood_group             0 non-null      float64
 5   neighbourhood                   96871 non-null  object
 6   latitude                        96871 non-null  float64
 7   longitude                       96871 non-null  float64
 8   room_type                       96871 non-null  object
 9   price                           61963 non-null  float64
 10  minimum_nights                  96871 non-null  int64
 11  number_of_reviews               96871 non-null  int64
 12  last_review                     72749 non-null  datetime64[ns]
 13  reviews_per_month               72749 non-null  float64
 14  calculated_host_listings_count  96871 non-null  int64
 15  availability_365                96871 non-null  int64
 16  number_of_reviews_ltm           96871 non-null  int64
 17  license                         0 non-null      float64
 18  price_per_booking               61963 non-null  float64
dtypes: datetime64[ns](1), float64(7), int64(7), object(4)
memory usage: 14.0+ MB

In [30]:
# Zero Listings
clean_df[clean_df['availability_365'] == 0]

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license,price_per_booking
10,39387,Stylish bedsit in Notting Hill ish flat.,168920,Alec,NaN,Westminster,51.526050,-0.199420,Private room,NaN,5,10,2019-11-03,0.07,1,0,0,NaN,NaN
12,41509,Room in maisonette in chiswick,181028,Peter,NaN,Hounslow,51.493510,-0.255680,Private room,NaN,1,71,2019-12-23,0.41,1,0,0,NaN,NaN
14,41870,Room in relaxed family house!,182993,Bimpe,NaN,Waltham Forest,51.558400,0.002580,Private room,NaN,2,2,2011-07-02,0.01,1,0,0,NaN,NaN
16,42692,Fabulous flat w garden and bkfst!,186510,Shelley,NaN,Hammersmith and Fulham,51.508220,-0.215620,Private room,NaN,1,0,NaT,NaN,1,0,0,NaN,NaN
20,45168,Best Part of Town -Home from Home!,199549,Lina,NaN,Westminster,51.518120,-0.197700,Entire home/apt,NaN,3,101,2020-01-03,0.55,1,0,0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
96506,1505753407474996400,Comfortable Private Room | Easy London Access,400153818,Vijeletchimi,NaN,Redbridge,51.610113,0.120368,Private room,42.0,1,0,NaT,NaN,1,0,0,NaN,42.0
96726,1507379912628821669,Hyde Park & Queensway station Stylish Flat,49338227,Antonio,NaN,Westminster,51.511840,-0.186360,Entire home/apt,128.0,2,0,NaT,NaN,34,0,0,NaN,256.0
96769,1507903090017785199,Cosy Home with Balcony In historic Clerkenwell,23423420,Haichuan,NaN,Islington,51.529827,-0.115584,Entire home/apt,126.0,2,0,NaT,NaN,1,0,0,NaN,252.0
96802,1508035572405785232,Stylish canal side London home,41502533,Zheng,NaN,Hackney,51.537790,-0.079260,Entire home/apt,98.0,7,0,NaT,NaN,1,0,0,NaN,686.0
96840,1508680755400249910,The Ald Den (Studio),120757802,Erica,NaN,Enfield,51.639750,-0.101330,Private room,70.0,3,0,NaT,NaN,1,0,0,NaN,210.0

In [31]:
clean_df = clean_df[clean_df['availability_365'] > 0]

In [33]:
# Zero Listings Removal COnfirmation
clean_df[clean_df['availability_365'] == 0].count()

id                                0
name                              0
host_id                           0
host_name                         0
neighbourhood_group               0
neighbourhood                     0
latitude                          0
longitude                         0
room_type                         0
price                             0
minimum_nights                    0
number_of_reviews                 0
last_review                       0
reviews_per_month                 0
calculated_host_listings_count    0
availability_365                  0
number_of_reviews_ltm             0
license                           0
price_per_booking                 0
dtype: int64

In [34]:
# Bucket availability into categories using availability_365
def availability_bucket(x):
    if pd.isna(x):
        return 'Unknown'
    if x > 300:
        return 'Full-time'
    if 100 <= x <= 300:
        return 'Part-time'
    if x < 100:
        return 'Rare'
    return 'Unknown'

In [35]:
clean_df['availability_bucket'] = clean_df['availability_365'].apply(availability_bucket)

In [36]:
clean_df['availability_bucket'].head(3)

0    Full-time
1    Part-time
2         Rare
Name: availability_bucket, dtype: object

In [39]:
top10_neighbour_by_price = (clean_df.groupby('neighbourhood')['price']
                                .mean()
                                .sort_values(ascending=False)
                                .head(10)
                                .reset_index()
                                .rename(columns={'price':'avg_price'}))

top10_neighbour_by_price

            neighbourhood   avg_price
0           Tower Hamlets  434.835867
1          City of London  353.923611
2                 Lambeth  346.183966
3             Westminster  340.723515
4  Kensington and Chelsea  334.646430
5                  Camden  216.279793
6               Islington  213.680741
7  Hammersmith and Fulham  198.096052
8              Wandsworth  197.738255
9    Richmond upon Thames  184.068579

In [40]:
avg_avail_price_by_room = (clean_df.groupby('room_type')
                               .agg(avg_availability=('availability_365','mean') if 'availability_365' in clean_df.columns else ('price','mean'),
                                    avg_price=('price','mean'))
                               .reset_index())

avg_avail_price_by_room

         room_type  avg_availability   avg_price
0  Entire home/apt        211.609027  278.515157
1       Hotel room        257.716049  694.911765
2     Private room        219.787841  120.431593
3      Shared room        262.173913   97.048913

In [41]:
host_counts = clean_df.groupby(['host_id', 'host_name']).size().reset_index(name='listing_count')
host_most_listings = host_counts.sort_values('listing_count', ascending=False).head(1)

host_most_listings

         host_id          host_name  listing_count
23837  446820235  LuxurybookingsFZE            500

In [42]:
avg_price_by_borough = (clean_df.groupby('neighbourhood_group')['price']
                            .mean()
                            .reset_index()
                            .rename(columns={'price':'avg_price'})
                            .sort_values('avg_price', ascending=False))

avg_price_by_borough

Empty DataFrame
Columns: [neighbourhood_group, avg_price]
Index: []

In [45]:
# How many listings have never been reviewed?

In [43]:
int(clean_df['last_review'].isna().sum())

14852

In [44]:
int((clean_df['number_of_reviews'] == 0).sum())

14852